src/cfe/КСП/InformationRegisters/ксп_ОтложенноеПроведениеПроблемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ОтложенноеПроведениеПроблемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТаблЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Comment>нумерация - с единицы!</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_ОтложенноеПроведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ОтложенноеПроведение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/CommonModules/ксп_ИмпортСлужебный/Ext/Module.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция НайтиНоменклатуру(УзелНоменклатуры) Экспорт
	
	НоменклатураГУИД = "";
	Если УзелНоменклатуры.Свойство("Ref", НоменклатураГУИД) Тогда
		Возврат Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(НоменклатураГУИД));
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции


//#Область ВидыЦен

//// ищет элемент при импорте - по узлу json-текста
//Функция НайтиВидЦены(Узел, ВнешняяСистема) Экспорт

//	Рез = Неопределено;
//	ГУИД = "";
//	Если узел.Свойство("Ref", ГУИД) Тогда
//		Рез = НайтиВидЦеныПоГУИД(ГУИД, ВнешняяСистема);
//	КонецЕсли;
//	Возврат Рез;
//	
//КонецФункции

//// ищет элемент по ГУИД в мэппинге, если там нет - в справочнике
//Функция НайтиВидЦеныПоГУИД(ГУИД, ВнешняяСистема) Экспорт
//	
//	Если НЕ ЗначениеЗаполнено(ГУИД) Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Рез = РегистрыСведений.ксп_МэппингСправочникТипыЦенНоменклатуры.ПоМэппингу(ГУИД, ВнешняяСистема);
//	
//	Если НЕ ЗначениеЗаполнено(Рез) ИЛИ НЕ ЗначениеЗаполнено(Рез.ВерсияДанных) Тогда
//		Рез = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
//	КонецЕсли;
//	
//	Возврат Рез;
//	
//КонецФункции

//#КонецОбласти

//// Описание_метода
////
//// Параметры:
////	Параметр1 	- Тип1 - 
////
//// Возвращаемое значение:
////	Тип: Тип_значения
////
//Функция НайтиВалюту(УзелВалюты) Экспорт
//	
//	ВалютаКод = "";
//	Если УзелВалюты.Свойство("currencyCode", ВалютаКод) Тогда
//		Возврат Справочники.Валюты.НайтиПоКоду(ВалютаКод);
//	КонецЕсли;
//		
//	Возврат Неопределено;

//КонецФункции

//// Описание_метода
////
//// Параметры:
////	Параметр1 	- Тип1 - 
////
//// Возвращаемое значение:
////	Тип: Тип_значения
////
//Функция НайтиПроект(УзелПроект) Экспорт
//	
//	ПроектГУИД = "";
//	Если УзелПроект.Свойство("Ref", ПроектГУИД) Тогда
//		Возврат Справочники.Проекты.ПолучитьСсылку(Новый УникальныйИдентификатор(ПроектГУИД));
//	КонецЕсли;
//		
//	Возврат Неопределено;


//КонецФункции

//// Описание_метода
////
//// Параметры:
////	Параметр1 	- Тип1 - 
////
//// Возвращаемое значение:
////	Тип: Тип_значения
////
//Функция НайтиПодразделение(УзелПодразделение) Экспорт
//	
//	ПодразделениеГУИД = "";
//	Если УзелПодразделение.Свойство("Ref", ПодразделениеГУИД) Тогда
//		Возврат Справочники.Подразделения.ПолучитьСсылку(Новый УникальныйИдентификатор(ПодразделениеГУИД));
//	КонецЕсли;
//		
//	Возврат Неопределено;


//КонецФункции


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция НайтиБанковскийСчетОрганизации(НомерСчета, БИК) Экспорт
		
	Банк = НайтиБанк(БИК);
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Банк = &Банк";
	
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция НайтиБанковскийСчетКонтрагента(НомерСчета, БИК) Экспорт
		
	Банк = НайтиБанк(БИК);
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Банк = &Банк";
	
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция НайтиБанк(БИК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторБанков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторБанков КАК КлассификаторБанков
		|ГДЕ
		|	КлассификаторБанков.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", БИК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция НайтиДисконтнуюКарту(Штрихкод, МагнитныйКод) Экспорт

	Если ЗначениеЗаполнено(МагнитныйКод) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИнформационныеКарты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
			|ГДЕ
			|	ИнформационныеКарты.КодКарты = &КодКарты";
		
		Запрос.УстановитьПараметр("КодКарты", МагнитныйКод);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(Штрихкод) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Владелец КАК ИнфКарта
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Штрихкод = &Штрихкод";
		
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.ИнфКарта;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиОрганизацию(Узел, ВнешняяСистема) Экспорт
	
	Организация = Неопределено;
	гуид = "";
	Если узел.Свойство("Ref", гуид) Тогда
		Организация = РегистрыСведений.ксп_МэппингСправочникОрганизации.ПоМэппингу(гуид, ВнешняяСистема);
		Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Организация.ВерсияДанных) Тогда
			Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(гуид));
		КонецЕсли;
	КонецЕсли;
		
	Возврат Организация;
	
КонецФункции

Функция НайтиКонтрагента(Узел, ВнешняяСистема) Экспорт
	
	Контрагент = Неопределено;
	ГУИД = "";
	Если узел.Свойство("Ref", ГУИД) Тогда
		Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиГруппуФинансовогоУчета (Узел, ВнешняяСистема) Экспорт
		
	ГруппаФинансовогоУчета = Неопределено;
	ГУИД = "";
	Если узел.Свойство("Ref", ГУИД) Тогда
		ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиДоговор(УзелДоговора, УзелКонтрагента = Неопределено, КонтрагентСсылка = Неопределено) Экспорт

	Рез = Неопределено;
	ГУИД = "";
	Если УзелДоговора.Свойство("Ref", ГУИД) Тогда
		Рез = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат Рез;
		
КонецФункции

Функция НайтиНазначение(Узел, ВнешняяСистема) Экспорт

	Назначение = Неопределено;
	ГУИД = "";
	Если Узел.Свойство("Ref", ГУИД) Тогда
		Назначение = Справочники.Назначения.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат Назначение;
		
КонецФункции

Функция НайтиПодразделение(Узел, ВнешняяСистема) Экспорт

	Подразделение = Неопределено;
	ГУИД = "";
	Если Узел.Свойство("Ref", ГУИД) Тогда
		Подразделение = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат Подразделение;
		
КонецФункции

Функция НайтиСкидкуНаценку(Узел, ВнешняяСистема) Экспорт

	СкидкаНаценка = Неопределено;
	ГУИД = "";
	Если Узел.Свойство("Ref", ГУИД) Тогда
		СкидкаНаценка = Справочники.СкидкиНаценки.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат СкидкаНаценка;
		
КонецФункции

Функция НайтиБонуснуюПрограммуЛояльности(Узел, ВнешняяСистема) Экспорт

	БонуснаяПрограмма = Неопределено;
	ГУИД = "";
	Если Узел.Свойство("Ref", ГУИД) Тогда
		БонуснаяПрограмма = Справочники.БонусныеПрограммыЛояльности.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;
	
	Возврат БонуснаяПрограмма;
		
КонецФункции

Функция НайтиХарактеристику(УзелХарактеристики) Экспорт
	
	ХарактеристикаГУИД = "";
	Если УзелХарактеристики.Свойство("Ref", ХарактеристикаГУИД) Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ХарактеристикаГУИД));
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

Функция НайтиЕдиницуИзмерения(УзелЕдиницы, УзелНоменклатуры = Неопределено) Экспорт
	
	Наименование = "";
	УзелЕдиницы.Свойство("Наименование", Наименование);
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Владелец = "";
	УзелЕдиницы.Свойство("Owner", Владелец);
	
	Если (НЕ ЗначениеЗаполнено(Владелец)) 
		ИЛИ
		(Владелец.type = "Справочник.НаборыУпаковок"
		И
		Владелец.Predefined = true
		И
		Владелец.PredefinedName = "БазовыеЕдиницыИзмерения")
		Тогда
		Возврат Справочники.БазовыеЕдиницыИзмерения.НайтиПоНаименованию(УзелЕдиницы.Наименование, Истина);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Владелец) И Владелец.type = "Справочник.Номенклатура" Тогда
		
		Если ЗначениеЗаполнено(УзелНоменклатуры) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	УпаковкиНоменклатуры.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
				|ГДЕ
				|	УпаковкиНоменклатуры.Наименование = &Наименование
				|	И УпаковкиНоменклатуры.Владелец = &Владелец";
			
			//через имя общ модуля, чтобы ПИ работало
			Владелец = ксп_ИмпортСлужебный.НайтиНоменклатуру(УзелНоменклатуры);
			
			Запрос.УстановитьПараметр("Владелец", Владелец);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Возврат ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
		КонецЕсли;	
		
	КонецЕсли;
	
		
	Возврат Неопределено;
	
КонецФункции

Функция НайтиАналитикуУчетаНоменклатуры(Узел) Экспорт
	
	АналитикаУчетаНоменклатурыГУИД = "";
	Если Узел.Свойство("Ref", АналитикаУчетаНоменклатурыГУИД) Тогда
		Возврат Справочники.КлючиАналитикиУчетаНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(АналитикаУчетаНоменклатурыГУИД));
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции




// Заглушка для общих действий после импорта документа
//
// Параметры:
//	ОбъектДанных	- ДокументОбъект - объект документа после метода Записать()
//	мВнешняяСистема	- строка - имя внешней системы, из которой пришел документ 
//	СтруктураОбъекта 	- структура - json-строка прочитанная в структуру
//	jsonText	- строка - исходный текст сообщения
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция Документы_ПослеИмпорта_01(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ОбъектПлагина) Экспорт
	
	// ЕНС. Это должно вызываться из ПроверитьКачествоДанных()
	//ДобавитьОтложенноеПроведение(ОбъектДанных.Ссылка);
	
	Возврат Неопределено;
	
	//_Ссылка = ОбъектДанных.Ссылка;
	//
	//Попытка
	//	
	//	ОбъектДанных.ОбменДанными.Загрузка = Ложь;
	//	деф = СтруктураОбъекта.definition;
	//	Если деф.isPosted Тогда 
	//		ОбъектДанных.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//	КонецЕсли;
	//	
	//Исключение
	//    ЗаписьЖурналаРегистрации("ИмпортИзRabbit", УровеньЖурналаРегистрации.Ошибка,,_Ссылка,"Не удалось провести документ при импорте!");
	//КонецПопытки;
	//
	//Возврат Неопределено;
	
КонецФункции

// Заглушка для общих действий после импорта документа
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция Документы_ПослеИмпорта_02(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ОбъектПлагина) Экспорт
	
	// сохранить исходный json
	РегистрыСведений.ксп_ИсходныеДанныеСообщений.ДобавитьЗапись(ОбъектДанных.Ссылка, jsonText, мВнешняяСистема);

	Возврат Неопределено;
	
КонецФункции

// Заглушка для общих действий после импорта документа
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция Документы_ПослеИмпорта_03(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ОбъектПлагина) Экспорт
	
	Если ТипЗнч(СтруктураОбъекта)=Тип("Структура") И СтруктураОбъекта.Свойство("definition") Тогда
		Если ТипЗнч(СтруктураОбъекта.definition)=Тип("Структура") И СтруктураОбъекта.definition.Свойство("Проведен") Тогда
			Если СтруктураОбъекта.definition.Проведен = Истина Тогда
				ПроверитьКачествоДанных(ОбъектДанных, ОбъектПлагина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Неопределено;
	
КонецФункции

// Заглушка для общих действий после импорта документа
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция Документы_ПослеИмпорта_04(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ОбъектПлагина) Экспорт
	
		
	Возврат Неопределено;
	
КонецФункции

// Заглушка для общих действий после импорта документа
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция Документы_ПослеИмпорта_05(ОбъектДанных, мВнешняяСистема, СтруктураОбъекта, jsonText, ОбъектПлагина) Экспорт
	
		
	Возврат Неопределено;
	
КонецФункции





// Добавляет записи в регистры сведений:
// ксп_ОтложенноеПроведение
// ксп_ОтложенноеПроведениеПроблемы
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьПроблемуОтложенногоПроведения(ДанныеСсылка, ИмяРеквизита, ИмяТаблЧасти=Неопределено, НомерСтрокиТЧ=0, ВидПроблемы) Экспорт
	
		
	Если ВидПроблемы = Перечисления.ксп_ВидыПроблемКачестваДокументов.НетЗначения Тогда
	ИначеЕсли ВидПроблемы = Перечисления.ксп_ВидыПроблемКачестваДокументов.БитаяСсылка Тогда
		
	КонецЕсли; 
	
	НЗ = РегистрыСведений.ксп_ОтложенноеПроведениеПроблемы.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокументСсылка.Установить(ДанныеСсылка);
	НЗ.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
	НЗ.Отбор.ИмяТаблЧасти.Установить(ИмяТаблЧасти);
	НЗ.Отбор.НомерСтрокиТЧ.Установить(НомерСтрокиТЧ);
	
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда
		
		стрк = НЗ[0];
		
	Иначе 
		
		стрк = НЗ.Добавить();
		стрк.ДокументСсылка = ДанныеСсылка;
		стрк.ИмяРеквизита = ИмяРеквизита;
		стрк.ИмяТаблЧасти = ИмяТаблЧасти;
		стрк.НомерСтрокиТЧ = НомерСтрокиТЧ;
		
	КонецЕсли;
	
	стрк.ОписаниеПроблемы = "";
	стрк.ВидПроблемы = ВидПроблемы;
	
	НЗ.Записать();
		
КонецПроцедуры

// Добавляем документ к отложенному проведению. Статус передаем через параметр
Процедура ДобавитьОтложенноеПроведение(ДанныеСсылка, СтатусОбъекта = Неопределено) Экспорт
	
	НЗ = РегистрыСведений.ксп_ОтложенноеПроведение.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокументСсылка.Установить(ДанныеСсылка);
	
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда
		
		стрк = НЗ[0];
		
	Иначе 
		
		стрк = НЗ.Добавить();
		стрк.ДокументСсылка = ДанныеСсылка;
			
	КонецЕсли; 
	
	Если СтатусОбъекта = Неопределено Тогда
		стрк.СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.ОК;
	Иначе 
		стрк.СтатусОбъекта = СтатусОбъекта;
	КонецЕсли;
	
	стрк.СтатусПроведения = Перечисления.КСП_СтатусыОтложенногоПроведения.НеПроведен;
	
	НЗ.Записать();
			
КонецПроцедуры

// Описание_метода
//
// Параметры:
//	ДокументОбъект 	- Объект документ - объект в данном случае удобнее, т.к. он есть в контексте места вызова
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПроверитьКачествоДанных(ДокументОбъект, ОбъектОбработкиИмпорта) Экспорт
	
	СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.ОК;
	
	РегистрыСведений.ксп_ОтложенноеПроведениеПроблемы.ОчиститьПоДокументу(ДокументОбъект.Ссылка);
	
	// проверить шапку
	
	МассивРеквизитовШапкиДляПроверки = ОбъектОбработкиИмпорта.МассивРеквизитовШапкиДляПроверки();
	
	ОбнаруженыПустыеРеквизиты = Ложь;
	Для каждого РеквизитИмя Из МассивРеквизитовШапкиДляПроверки Цикл
		
		РеквизитЗначение = ДокументОбъект[РеквизитИмя];
		
		// Да, здесь дублирование кода и можно переписать компактнее. Но так - нагляднее
		
		Если ТипЗнч(РеквизитЗначение) = Тип("Булево") или ТипЗнч(РеквизитЗначение) = Тип("Строка") или ТипЗнч(РеквизитЗначение) = Тип("Число")
			или ТипЗнч(РеквизитЗначение) = Тип("Дата") или ТипЗнч(РеквизитЗначение) = Тип("Неопределено") Тогда
	
			Если НЕ ЗначениеЗаполнено(РеквизитЗначение) Тогда 
				
				ДобавитьПроблемуОтложенногоПроведения(
					ДокументОбъект.Ссылка, РеквизитИмя, Неопределено, 0, 
					Перечисления.ксп_ВидыПроблемКачестваДокументов.НетЗначения);
					
				СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.Ошибка;
					
				ОбнаруженыПустыеРеквизиты = Истина;
			КонецЕсли;	
			
		Иначе	// ссылочный тип	
			
			Если НЕ ЗначениеЗаполнено(РеквизитЗначение) Тогда 
				
				ДобавитьПроблемуОтложенногоПроведения(
					ДокументОбъект.Ссылка, РеквизитИмя, Неопределено, 0, 
					Перечисления.ксп_ВидыПроблемКачестваДокументов.НетЗначения);
					
				СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.Ошибка;
				
				ОбнаруженыПустыеРеквизиты = Истина;
//{{MRG[ <-> ]
//			Иначе 
//				
//}}MRG[ <-> ]
				
//{{MRG[ <-> ]
			ИначеЕсли ЗначениеЗаполнено(РеквизитЗначение) 
				И НЕ ЗначениеЗаполнено(РеквизитЗначение.ВерсияДанных) Тогда
//				Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(РеквизитЗначение)) Тогда
//					//ничего не делаем
//				ИначеЕсли НЕ ЗначениеЗаполнено(РеквизитЗначение.ВерсияДанных) Тогда
				ДобавитьПроблемуОтложенногоПроведения(
					ДокументОбъект.Ссылка, РеквизитИмя, Неопределено, 0, 
					Перечисления.ксп_ВидыПроблемКачестваДокументов.БитаяСсылка);
				СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.Ожидание;	
				ОбнаруженыПустыеРеквизиты = Истина;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	// А здесь дублирование кода, чтобы быстрее работало - не стал выносить в отдельный метод,
	// чтобы интерпретатор не тратил время на его вызов
	
	// ЕНС. Этого метода в обработке может не быть, поэтому через попытку
	//ТЗ, Колонки:
	// * ИмяТЧ
	// * ИмяКолонки       
	Попытка
		ТабличныеЧастиДляПроверки = ОбъектОбработкиИмпорта.ТабличныеЧастиДляПроверки();
	Исключение
	    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	Если ТипЗнч(ТабличныеЧастиДляПроверки) = тип("ТаблицаЗначений") Тогда
		Для каждого стрк Из ТабличныеЧастиДляПроверки Цикл   // перебор имен колонок ТЧ
			
			счСтрок = 1;
			Для каждого стркТЧ Из ДокументОбъект[стрк.ИмяТЧ] Цикл
				
				РеквизитЗначение = стркТЧ[стрк.ИмяКолонки];
				
				РеквизитИмя = стрк.ИмяКолонки;
				
			
				Если ТипЗнч(РеквизитЗначение) = Тип("Булево") или ТипЗнч(РеквизитЗначение) = Тип("Строка") или ТипЗнч(РеквизитЗначение) = Тип("Число")
					или ТипЗнч(РеквизитЗначение) = Тип("Дата") или ТипЗнч(РеквизитЗначение) = Тип("Неопределено") Тогда
			
					Если НЕ ЗначениеЗаполнено(РеквизитЗначение) Тогда 
						
						ДобавитьПроблемуОтложенногоПроведения(
							ДокументОбъект.Ссылка, РеквизитИмя, стрк.ИмяТЧ, счСтрок, 
							Перечисления.ксп_ВидыПроблемКачестваДокументов.НетЗначения);
							
						СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.Ошибка;
						
						ОбнаруженыПустыеРеквизиты = Истина;
					КонецЕсли;	
					
				Иначе	// ссылочный тип	
					
					Если НЕ ЗначениеЗаполнено(РеквизитЗначение) Тогда 
						
						ДобавитьПроблемуОтложенногоПроведения(
							ДокументОбъект.Ссылка, РеквизитИмя, стрк.ИмяТЧ, счСтрок, 
							Перечисления.ксп_ВидыПроблемКачестваДокументов.НетЗначения);
							
						СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.Ошибка;
						
						ОбнаруженыПустыеРеквизиты = Истина;
					ИначеЕсли ЗначениеЗаполнено(РеквизитЗначение) 
						И НЕ ЗначениеЗаполнено(РеквизитЗначение.ВерсияДанных) Тогда

						ДобавитьПроблемуОтложенногоПроведения(
							ДокументОбъект.Ссылка, РеквизитИмя, стрк.ИмяТЧ, счСтрок, 
							Перечисления.ксп_ВидыПроблемКачестваДокументов.БитаяСсылка);
							
						СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.Ожидание;
						
						ОбнаруженыПустыеРеквизиты = Истина;
					КонецЕсли;
					
				КонецЕсли;	
				
				счСтрок = счСтрок + 1;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	// в конце - финальная проверка на наличие проблем
	Если НЕ ОбнаруженыПустыеРеквизиты Тогда
		СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.ОК;
		
	Иначе
		// статус уже определен ранее
		
	КонецЕсли;
//{{MRG[ <-> ]
//
//	Попытка
//		// в обработке может не быть метода ТребуетсяПроведение() (пока он в процессе добавления)
//		Если ОбъектОбработкиИмпорта.ТребуетсяПроведение() Тогда
//			ДобавитьОтложенноеПроведение(ДокументОбъект.Ссылка, СтатусОбъекта);
//		КонецЕсли;
//	Исключение
//	    
//	КонецПопытки;
//}}MRG[ <-> ]
	
	ДобавитьОтложенноеПроведение(ДокументОбъект.Ссылка, СтатусОбъекта);
		
	Возврат Неопределено;
	
КонецФункции
